{
  "channel_id": "UCeDF9E2rwf_iQhcVGoFiqKQ",
  "videos": [
    {
      "video_id": "p7Pe4TiHp34",
      "title": "Classic Ren & Stimpy - These dirty hands...",
      "thumbnail": "https://i.ytimg.com/vi/p7Pe4TiHp34/hqdefault.jpg",
      "published_at": "2015-10-25T03:21:21Z",
      "duration": 136.0,
      "description": "Ren cracking up over Stimpy's fan club",
      "tags": [
        "ren & stimpy",
        "The Ren & Stimpy Show (TV Program)",
        "Stimpy (Fictional Character)"
      ],
      "view_count": 44511,
      "channel_id": "UCeDF9E2rwf_iQhcVGoFiqKQ",
      "url": "https://www.youtube.com/watch?v=p7Pe4TiHp34"
    },
    {
      "video_id": "V-QAXz3dfb8",
      "title": "Easter Message",
      "thumbnail": "https://i.ytimg.com/vi/V-QAXz3dfb8/hqdefault.jpg",
      "published_at": "2024-04-02T20:41:43Z",
      "duration": 2920.0,
      "description": "Hi everybody. This is a short Easter message I put together a year or two ago. It's been up on the Martyr Made Substack (https://subscribe.martyrmade.com/)  - which you should all go subscribe to at your earliest convenience - but I thought I'd release it here for everyone. I hope everyone had a blessed week, and that you have a blessed day. Happy Easter.",
      "tags": [],
      "view_count": 3732,
      "channel_id": "UCeDF9E2rwf_iQhcVGoFiqKQ",
      "url": "https://www.youtube.com/watch?v=V-QAXz3dfb8"
    },
    {
      "video_id": "xq0cofYKSIs",
      "title": "The Prodigal Sons - Nietzsche and Dostoevsky (Novitate Conference, Nov 2023)",
      "thumbnail": "https://i.ytimg.com/vi/xq0cofYKSIs/hqdefault.jpg",
      "published_at": "2024-04-02T20:41:43Z",
      "duration": 5156.0,
      "description": "Hi everyone. Here is a talk I gave about Nietzsche and Dostoevsky at the first inaugural Novitate Conference (https://novitateconference.org/)  in Washington, DC. Novitate was created by Luke Burgis (https://read.lukeburgis.com/)  to explore and celebrate the work of French scholar René Girard. Luke is the author of Wanting: The Power of Mimetic Desire in Everyday Life (https://www.amazon.com/Wanting-Power-Mimetic-Desire-Everyday/dp/1250262488) .\n\nPlease support the podcast by subscribing to the Martyr Made Substack (https://subscribe.martyrmade.com/)  for just $5 p/month, or $50 p/year. For that, you get access to tons of exclusive essays (w/audio versions for those who prefer to listen), podcasts, interviews, and AMAs, as well as a discount on all MartyrMade gear. This is a 100% listener-supported operation, and I'm only able to do this because of you guys.",
      "tags": [],
      "view_count": 6194,
      "channel_id": "UCeDF9E2rwf_iQhcVGoFiqKQ",
      "url": "https://www.youtube.com/watch?v=xq0cofYKSIs"
    },
    {
      "video_id": "Xs9V5EuoD3U",
      "title": "Blacks and Jews (Complete Series)",
      "thumbnail": "https://i.ytimg.com/vi/Xs9V5EuoD3U/hqdefault.jpg",
      "published_at": "2024-04-02T20:41:43Z",
      "duration": 12068.0,
      "description": "Hi everybody. This is the audio version of a six-part essay series called Blacks and Jews. I wrote it for my Substack a while back, so if it sounds like I’m reading instead of speaking naturally, it’s because in this case I am. I decided to release this to everyone on the main feed because, in light of the recent uproar and brewing Democratic Party civil war over the Israel-Palestine conflict, it’s suddenly become quite timely. Black and Jewish Americans were uniquely united until the late 1960s, when the civil rights movement was subsumed by a Third Worldist outlook that caused the Black Panthers and other activists to turn on the State of Israel, and then on American Jews. It precipitated a split in the so-called Black-Jewish alliance which had been the backbone of the civil rights movement during its glory years, and led to some of the worst outbursts of public antisemitism in American history. The intra-left wing conflict over the current conflict in Gaza is not a new story, and in fact is an example of scabs being torn off old wounds that had barely begun to heal. I wrote this series as I was preparing the most recent episode of Whose America, Inner City Blues, so those of you who’ve heard that will be familiar with some of the material, but there’s also a lot of material that wasn’t in that episode.\n\nAs I said, this was previously released on my Substack (https://subscribe.martyrmade.com/) , so if you enjoy this kind of content maybe you’ll show a little holiday cheer and help support the podcast by becoming a subscriber for just $5 p/month or $50 p/year. This is a 100% listener-funded show, I don’t have sponsors or any other kind of funding except what you guys contribute, so your generosity is greatly appreciated.",
      "tags": [],
      "view_count": 11187,
      "channel_id": "UCeDF9E2rwf_iQhcVGoFiqKQ",
      "url": "https://www.youtube.com/watch?v=Xs9V5EuoD3U"
    },
    {
      "video_id": "yrm8aOmQg-o",
      "title": "The Complete Jeffrey Epstein Series",
      "thumbnail": "https://i.ytimg.com/vi/yrm8aOmQg-o/hqdefault.jpg",
      "published_at": "2024-04-02T20:41:43Z",
      "duration": 19669.0,
      "description": "I’m re-uploading all the podcasts from a new hosting service, so I thought I’d go ahead and put the full Epstein series up while I was at it.\n\nThis series deals with some very dark material. It is not for listening with kids in the car or where other people can hear it at work.\n\nIf you appreciate this podcast, please consider helping to support it by subscribing to the MartyrMade Substack (http://subcribe.martyrmade.com)  for $5 p/month or $50 p/year. The Substack includes subscribers-only essays, and a subscribers-only podcast feed w/exclusive episodes and audio versions of all Substack essays. This is a 100% listener-funded show, so your support is greatly appreciated.\n\nIt’s available on iTunes (https://podcasts.apple.com/us/podcast/the-martyrmade-podcast/id978322714?i=1000636512516) , Spotify, or wherever you get your podcasts.",
      "tags": [],
      "view_count": 49541,
      "channel_id": "UCeDF9E2rwf_iQhcVGoFiqKQ",
      "url": "https://www.youtube.com/watch?v=yrm8aOmQg-o"
    },
    {
      "video_id": "c83S_HtobBA",
      "title": "War All the Time: Israel vs. Palestine, 1948-82 (Bonus Episode)",
      "thumbnail": "https://i.ytimg.com/vi/c83S_HtobBA/hqdefault.jpg",
      "published_at": "2024-04-02T20:41:43Z",
      "duration": 15650.0,
      "description": "This episode will cover the period from 1948 – the year of Israeli independence and the Palestinian Nakba – to the Lebanon War of 1982. It is not meant to be a thorough history of that period, as Fear & Loathing was of the pre-1948 period – to do that justice would require another ten episodes, not just one. This one has a narrower focus. The story we’re gonna hear today is not about every figure, and event, and motivation relevant to the conflict, but is specifically about how the level of savagery escalated over the years, the steps by which those escalations occurred, to bring us up to the where we are now, with virtually unrestrained violence completely normalized on both sides. It’s not a pretty story, and several sections of this podcast are not going to be for the faint of heart.\n\n\n\nPlease consider subscribing to the MartyrMade Substack page (https://subscribe.martyrmade.com) . The show is 100% listener supported, and Substack subscribers is the only way I’m able to keep doing this. Thanks for everything.",
      "tags": [],
      "view_count": 8146,
      "channel_id": "UCeDF9E2rwf_iQhcVGoFiqKQ",
      "url": "https://www.youtube.com/watch?v=c83S_HtobBA"
    },
    {
      "video_id": "ga0tyBtGAds",
      "title": "#23 Whose America?, pt. 2: Inner City Blues",
      "thumbnail": "https://i.ytimg.com/vi/ga0tyBtGAds/hqdefault.jpg",
      "published_at": "2024-04-02T20:41:43Z",
      "duration": 24114.0,
      "description": "The Great Migration of 1915-1960 saw over six million African Americans move from the rural South to the big cities of the North and West. It was one of the largest mass migrations in human history, and one whose consequences defined American domestic politics throughout the 20th century. But it wasn’t the first time the industrial cities of America had experienced massive demographic transformation, and the black migrants would run smack into the immigrants of previous generations. In the 1960s, frustration and anger turned to conflict, as race riots drove what was left of the white ethnics out of the inner cities. Today we tell the story of the battle for control of the Ocean Hill-Brownsville school district in New York City – a topic which might sound a bit dull, but was one of the most intense periods of racial conflict in recent American history. The conflict captured the attention of the country for months, and led to a split in the alliance between American blacks and American Jews that had powered the civil rights movement until the late 1960s.\n\nSUPPORT THE SHOW!\n\nI don’t use sponsors for this show. I work for you guys. If you’d like to help out, become a subscriber to the MartyrMade Substack (https://subscribe.martyrmade.com) . It’s just $5 p/month or $50 p/year, and you’ll have access to subscribers-only podcasts, essays (w/audio versions), interviews, and more. New subscribers will have some catching up to do. If anyone would like to be a subscriber, but can’t swing it right now, just shoot me an email and we’ll get you hooked up. I appreciate you guys letting me do this show.",
      "tags": [],
      "view_count": 3745,
      "channel_id": "UCeDF9E2rwf_iQhcVGoFiqKQ",
      "url": "https://www.youtube.com/watch?v=ga0tyBtGAds"
    },
    {
      "video_id": "k-tAltAGMIg",
      "title": "#1 - Fear & Loathing in the New Jerusalem, pt. 1",
      "thumbnail": "https://i.ytimg.com/vi/k-tAltAGMIg/hqdefault.jpg",
      "published_at": "2024-06-21T00:16:02Z",
      "duration": 8466.0,
      "description": "The conflict between Israel and Palestine can often seem like a permanent feature of the global order. The wars, intifadas, refugees camps, suicide vests, UN resolutions, and peace talks have been painfully burned into our collective consciousness. But how could this have happened? Was it always this way? That’s what we’ll seek to find out in this three-part series on the history of the Israeli-Palestinian conflict.\n\nIn Episode #1, nations are rallying to throw off the yoke of the Great Powers, and demanding the sovereign right to rule their homelands. A group calling themselves Zionists puts out a call to awaken the oppressed Jews of Europe from their thousand-year slumber. The time had come, after two thousand years of homeless wandering, to return to Palestine, the land longed for in so many psalms and lamentations. But there was a problem. While the Jews were in exile, another people had moved into the land, and they had been living there for 1300 years.﻿\n\nPlease support the podcast by subscribing to The Martyr Made Substack for just $5 p/month or $50 p/year. Link: subscribe.martyrmade.com",
      "tags": [],
      "view_count": 39248,
      "channel_id": "UCeDF9E2rwf_iQhcVGoFiqKQ",
      "url": "https://www.youtube.com/watch?v=k-tAltAGMIg"
    },
    {
      "video_id": "6iC9VKpOwsU",
      "title": "#2 - Fear and Loathing in the New Jerusalem, pt. 2",
      "thumbnail": "https://i.ytimg.com/vi/6iC9VKpOwsU/hqdefault.jpg",
      "published_at": "2024-06-21T00:16:05Z",
      "duration": 11933.0,
      "description": "The Arabs and the Zionists in Palestine struggle to get their bearings in a ruined world. The smell of gunsmoke still lays thick over the landscape, and the ink is still wet on the Balfour Declaration and the several new international agreements. The First World War is over, and people around the world are demanding their independence in the new world order. But building a national identity takes more than just drawing lines on a map or running a rag up a flagpole.",
      "tags": [],
      "view_count": 20531,
      "channel_id": "UCeDF9E2rwf_iQhcVGoFiqKQ",
      "url": "https://www.youtube.com/watch?v=6iC9VKpOwsU"
    },
    {
      "video_id": "T4T4joB9MYo",
      "title": "#3 - Fear & Loathing in the New Jerusalem - Nostalgia and Naivety in Honor Culture",
      "thumbnail": "https://i.ytimg.com/vi/T4T4joB9MYo/hqdefault.jpg",
      "published_at": "2024-06-21T00:16:07Z",
      "duration": 6244.0,
      "description": "We’re halfway through Fear & Loathing in the New Jerusalem, the history of Zionism and the Israeli-Palestinian conflict. (If you haven’t listened to the first two episodes, you might want to do that for background, but this episode is an exploratory aside that can stand on its own as well.) I decided to throw something together to answer a few questions and get down in the weeds to talk about Arab tribal dynamics, honor culture, religion, and the mutual incomprehension that helped construct the Middle Eastern mousetrap a century ago, and remains an obstacle to progress in the region today.\n\nPlease support the podcast by subscribing to The Martyr Made Substack for just $5 p/month or $50 p/year. Link: subscribe.martyrmade.com",
      "tags": [],
      "view_count": 9150,
      "channel_id": "UCeDF9E2rwf_iQhcVGoFiqKQ",
      "url": "https://www.youtube.com/watch?v=T4T4joB9MYo"
    },
    {
      "video_id": "hqzlGvvu2I4",
      "title": "#4 - Fear & Loathing in the New Jerusalem, pt. 3",
      "thumbnail": "https://i.ytimg.com/vi/hqzlGvvu2I4/hqdefault.jpg",
      "published_at": "2024-06-21T00:16:08Z",
      "duration": 15959.0,
      "description": "Hi everyone. Been a long time. My day job has been downright abusive the last 2-3 months, but we’re back with Episode 4 of Fear & Loathing in the New Jerusalem. As the Middle Eastern regional order is hammered into place by the Entente powers, Zionism goes underground. Prosperity abroad and security in Palestine make the 1920s a relatively quiet period in this story. It’s been chaos behind us and nothing but chaos in front, but we’re in the eye of the storm. The British try a more inclusive approach toward the Arabs, but as the real effects of the Zionist project begin to be felt, tensions rise until the decade ends as it began… in violence.\n\nPlease support the podcast by subscribing to The Martyr Made Substack for just $5 p/month or $50 p/year. Link: subscribe.martyrmade.com",
      "tags": [],
      "view_count": 14519,
      "channel_id": "UCeDF9E2rwf_iQhcVGoFiqKQ",
      "url": "https://www.youtube.com/watch?v=hqzlGvvu2I4"
    },
    {
      "video_id": "XI49zjYU05M",
      "title": "#5 - Fear & Loathing in the New Jerusalem - Things Fall Apart...",
      "thumbnail": "https://i.ytimg.com/vi/XI49zjYU05M/hqdefault.jpg",
      "published_at": "2024-06-21T00:16:09Z",
      "duration": 20144.0,
      "description": "Riots. Massacres. The end of the world and everything in it. Palestinian Arabs finally find a voice in the wake of the 1929 massacres. Unable and unwilling to find a place for the Jews, Europe’s autoimmune disorder begins to tear the host apart. Desperate European Jews seek escape from Nazi persecution just as Palestinian resistance stiffens and the British become skeptical of the Zionist project.\n\nPlease support the podcast by subscribing to The Martyr Made Substack for just $5 p/month or $50 p/year. Link: subscribe.martyrmade.com",
      "tags": [],
      "view_count": 12164,
      "channel_id": "UCeDF9E2rwf_iQhcVGoFiqKQ",
      "url": "https://www.youtube.com/watch?v=XI49zjYU05M"
    },
    {
      "video_id": "XRLLuWy-6tI",
      "title": "#6 - Fear & Loathing in the New Jerusalem - Never Again",
      "thumbnail": "https://i.ytimg.com/vi/XRLLuWy-6tI/hqdefault.jpg",
      "published_at": "2024-06-21T01:06:04Z",
      "duration": 19808.0,
      "description": "Modern Zionism began in the late 19th century with idealistic calls for spiritual renewal; by 1939, it had transformed into a desperate play for bare survival. Young revolutionaries do combat with Zionist elder statesmen for the soul of the movement. Hitler’s German Reich and Stalin’s Soviet Union do battle for Europe while everything between them is ground into the mud. Victims become victimizers, and the wider world gets an introduction to the dispute that has been confounding the British Empire for 20 years. Our episode begins with desperate Jews in Nazi Europe, it ends with the realization of the Zionist dream, for the first time in 2,000 years, a sovereign state of Israel.\n\nPlease support the podcast by subscribing to The Martyr Made Substack for just $5 p/month or $50 p/year. Link: subscribe.martyrmade.com",
      "tags": [],
      "view_count": 13910,
      "channel_id": "UCeDF9E2rwf_iQhcVGoFiqKQ",
      "url": "https://www.youtube.com/watch?v=XRLLuWy-6tI"
    },
    {
      "video_id": "1-8WzqVr_KI",
      "title": "#7 - Approaching the Aztecs - A Drunken Introduction",
      "thumbnail": "https://i.ytimg.com/vi/1-8WzqVr_KI/hqdefault.jpg",
      "published_at": "2024-06-21T01:06:05Z",
      "duration": 6342.0,
      "description": "In which I take a break from banging out my human sacrifice episode to check in with my patient listeners.\n\nPlease support the podcast by subscribing to The Martyr Made Substack for just $5 p/month or $50 p/year. Link: subscribe.martyrmade.com",
      "tags": [],
      "view_count": 3406,
      "channel_id": "UCeDF9E2rwf_iQhcVGoFiqKQ",
      "url": "https://www.youtube.com/watch?v=1-8WzqVr_KI"
    },
    {
      "video_id": "9BXOdMWkFHo",
      "title": "#8 - How to Serve Man - Sacrifice & Cannibalism, pt. 1",
      "thumbnail": "https://i.ytimg.com/vi/9BXOdMWkFHo/hqdefault.jpg",
      "published_at": "2024-06-21T01:06:07Z",
      "duration": 9783.0,
      "description": "Who’s hungry?\n\nPlease support the podcast by subscribing to The Martyr Made Substack for just $5 p/month or $50 p/year. Link: subscribe.martyrmade.com",
      "tags": [],
      "view_count": 4351,
      "channel_id": "UCeDF9E2rwf_iQhcVGoFiqKQ",
      "url": "https://www.youtube.com/watch?v=9BXOdMWkFHo"
    },
    {
      "video_id": "S49OxTe_D_4",
      "title": "#9 – Sacrifice & Oppression at the Dawn of Tyranny",
      "thumbnail": "https://i.ytimg.com/vi/S49OxTe_D_4/hqdefault.jpg",
      "published_at": "2024-06-21T01:06:10Z",
      "duration": 10436.0,
      "description": "“Mexica ‘beliefs’ have been discussed confidently enough, but academics being natural theologians, usually at an unnaturally abstract pitch. My interest is not in belief at this formal level, but in sensibility: the emotional, moral, and aesthetic nexus through which thought comes to be expressed in action, and so made public, visible, and accessible to our observation.”\n\n-Inga Clenninden | Aztecs: An Interpretation\n\nHuman sacrifice is not a human universal. The institution emerges at a specific stage of human sociopolitical development, and recedes when the transition is complete. Rarely found among nomadic hunter-gatherers, ritual homicide is also nearly absent in archaic civilizations (except for a few residual instances such as royal burials). But human beings didn’t make the leap from nomadic foragers to pyramid builders overnight. Nestled between was a transitional stage, when newly-settled people faced the monumental task of ditching the ancient kinship system, sacrificing their freedom to kings, and reorganizing themselves into the first states. This fraught transition was imposed by violence, as primitive egalitarianism was replaced by class oppression, and human sacrifice was employed to define social boundaries and to stave off panic with brutal acts of self-assertion. Kings gloried in their total freedom, the less fortunate were terrorized into submission, and the gods looked on with dripping fangs and growling stomachs.\n\nPlease support the podcast by subscribing to The Martyr Made Substack for just $5 p/month or $50 p/year. Link: subscribe.martyrmade.com",
      "tags": [],
      "view_count": 2713,
      "channel_id": "UCeDF9E2rwf_iQhcVGoFiqKQ",
      "url": "https://www.youtube.com/watch?v=S49OxTe_D_4"
    },
    {
      "video_id": "0pttO_L6ack",
      "title": "#10 - Anything That Moves - The My Lai Massacre (w/History on Fire)",
      "thumbnail": "https://i.ytimg.com/vi/0pttO_L6ack/hqdefault.jpg",
      "published_at": "2024-06-21T01:06:12Z",
      "duration": 8547.0,
      "description": "This is part 2 of a series I’ve been working on with Daniele Bolelli. In part 1, he covered the 1864 Sand Creek Massacre carried out by the US Army. I was working on my next major series when Daniele asked me to do a companion episode on My Lai, and I couldn’t pass up the opportunity. From his description:\n\nPlease support the podcast by subscribing to The Martyr Made Substack for just $5 p/month or $50 p/year. Link: subscribe.martyrmade.com",
      "tags": [],
      "view_count": 3056,
      "channel_id": "UCeDF9E2rwf_iQhcVGoFiqKQ",
      "url": "https://www.youtube.com/watch?v=0pttO_L6ack"
    },
    {
      "video_id": "xZA32LPtksA",
      "title": "#11 - God's Socialist: Prologue",
      "thumbnail": "https://i.ytimg.com/vi/xZA32LPtksA/hqdefault.jpg",
      "published_at": "2024-06-21T01:06:14Z",
      "duration": 5546.0,
      "description": "This is the first episode of a series exploring Jim Jones and the Peoples Temple. This episode is only a prologue, a few stories and ideas to serve as a backdrop for everything to come. The next episode will be along in the next few weeks.\n\nPlease consider supporting the podcast by subscribing to The Martyr Made Substack for just $5 p/month or $50 p/year. Link: subscribe.martyrmade.com",
      "tags": [],
      "view_count": 7166,
      "channel_id": "UCeDF9E2rwf_iQhcVGoFiqKQ",
      "url": "https://www.youtube.com/watch?v=xZA32LPtksA"
    },
    {
      "video_id": "5RFT55ZhZWw",
      "title": "#12 - God's Socialist, pt. 2: What Child Is This?",
      "thumbnail": "https://i.ytimg.com/vi/5RFT55ZhZWw/hqdefault.jpg",
      "published_at": "2024-06-21T01:06:15Z",
      "duration": 11859.0,
      "description": "This is part 2 of a podcast series on Jim Jones and his Peoples Temple movement. An eccentric loner as a child, Jim Jones finds purpose in the fight for racial and economic justice.\n\nPlease consider supporting the podcast by subscribing to The Martyr Made Substack for just $5 p/month or $50 p/year. Link: subscribe.martyrmade.com\n\nThanks!",
      "tags": [],
      "view_count": 5714,
      "channel_id": "UCeDF9E2rwf_iQhcVGoFiqKQ",
      "url": "https://www.youtube.com/watch?v=5RFT55ZhZWw"
    },
    {
      "video_id": "UHOt4xegRNk",
      "title": "#13 – God’s Socialist, pt. 3: Head North, Then Turn Left",
      "thumbnail": "https://i.ytimg.com/vi/UHOt4xegRNk/hqdefault.jpg",
      "published_at": "2024-06-21T01:06:44Z",
      "duration": 14443.0,
      "description": "In this episode I trace the trajectory of the civil rights movement through the 1960s, and the gradual shift in emphasis and leadership from the stoic southern marchers following Martin Luther King, Jr to the militant Black Power soldiers of the northern ghettos.\n\nSupport the show by subscribing to the MartyrMade Substack (subscribe.martyrmade.com).",
      "tags": [],
      "view_count": 4212,
      "channel_id": "UCeDF9E2rwf_iQhcVGoFiqKQ",
      "url": "https://www.youtube.com/watch?v=UHOt4xegRNk"
    },
    {
      "video_id": "q5qxqa8HGlY",
      "title": "#14 - God's Socialist, pt. 4: Sex, Drugs & Revolution",
      "thumbnail": "https://i.ytimg.com/vi/q5qxqa8HGlY/hqdefault.jpg",
      "published_at": "2024-06-21T01:06:46Z",
      "duration": 23713.0,
      "description": "This episode discusses the beginning of Peoples' Temple's slide into radicalism after Jim Jones leads his people to California. We also talk about the development of 1960s radical political movements, and Jonestown conspiracy theories.\n\nI had to record this episode in a hotel bathroom while on travel for work. The audio quality has some issues at various points. Hopefully, it's not too bad.\n\nSupport the show by subscribing to the MartyrMade Substack (subscribe.martyrmade.com).",
      "tags": [],
      "view_count": 5201,
      "channel_id": "UCeDF9E2rwf_iQhcVGoFiqKQ",
      "url": "https://www.youtube.com/watch?v=q5qxqa8HGlY"
    },
    {
      "video_id": "rDmWP9fsGoQ",
      "title": "#15 - God’s Socialist, pt. 5: The Wounded King",
      "thumbnail": "https://i.ytimg.com/vi/rDmWP9fsGoQ/hqdefault.jpg",
      "published_at": "2024-06-21T01:06:48Z",
      "duration": 15969.0,
      "description": "This episode begins where the '60s end, when the radicalism of that decade crash headlong into the diminishing expectations of 1970s America. The Weather Underground veers off toward its explosive climax. As the idealism of the student movement is shunted into self-help fads and therapy sessions, what remaining energy of the radical left is drained into increasingly bizarre and violent channels.\n\nI broke this episode up into two parts, so it ends a bit abruptly. The second segment will be available a few hours after this is released.\n\nSupport the show by subscribing to the MartyrMade Substack (subscribe.martyrmade.com).",
      "tags": [],
      "view_count": 3383,
      "channel_id": "UCeDF9E2rwf_iQhcVGoFiqKQ",
      "url": "https://www.youtube.com/watch?v=rDmWP9fsGoQ"
    },
    {
      "video_id": "8e69oBuCMmk",
      "title": "#16 – God’s Socialist, pt. 6: No Driver At The Wheel",
      "thumbnail": "https://i.ytimg.com/vi/8e69oBuCMmk/hqdefault.jpg",
      "published_at": "2024-06-21T01:06:49Z",
      "duration": 9804.0,
      "description": "This was originally intended to be part of the previous episode, but I decided to break them up.\n\nWarning: EXTREME LANGUAGE AND GRAPHIC CONTENT\n\nThe student movement is dead. The Black Panther Party is torn apart by J. Edgar Hoover's FBI. Activism devolves into struggle sessions and terrorism, as the movement for civil rights and social justice is left to \"drunks, hypes, freaks, and madmen.\" Treason drives Jim Jones off a cliff.\n\nSupport the show by subscribing to the MartyrMade Substack (subscribe.martyrmade.com).",
      "tags": [],
      "view_count": 2242,
      "channel_id": "UCeDF9E2rwf_iQhcVGoFiqKQ",
      "url": "https://www.youtube.com/watch?v=8e69oBuCMmk"
    },
    {
      "video_id": "wpUHRth307w",
      "title": "#17 – God’s Socialist, pt. 7: A Gallant, Glorious, Screaming End",
      "thumbnail": "https://i.ytimg.com/vi/wpUHRth307w/hqdefault.jpg",
      "published_at": "2024-06-21T02:06:45Z",
      "duration": 28429.0,
      "description": "Jim Jones and Peoples Temple follow the remnants of the 1970s radical left into the fire.\n\nWARNING: Extreme language and disturbing content.\n\nSupport the show by subscribing to the MartyrMade Substack (subscribe.martyrmade.com).\n\nHuge thanks to the folks behind the Alternative Considerations of Jonestown Project. This podcast wouldn't have been possible without their indispensable hard work recording, organizing, and transcribing the Peoples Temple tapes and other source materials. For further information about Jonestown, you can't do better than their website. I did my best to tell the story here as I understand it, but if you ask me the work they're doing will lead to a fundamental future reassessment of what happened.",
      "tags": [],
      "view_count": 6192,
      "channel_id": "UCeDF9E2rwf_iQhcVGoFiqKQ",
      "url": "https://www.youtube.com/watch?v=wpUHRth307w"
    },
    {
      "video_id": "Mzs7YlFgkOc",
      "title": "#18 – The Madame Butterfly Effect (bonus episode)",
      "thumbnail": "https://i.ytimg.com/vi/Mzs7YlFgkOc/hqdefault.jpg",
      "published_at": "2024-06-21T02:06:52Z",
      "duration": 1705.0,
      "description": "A short episode about the time a group of Japanese terrorists massacred a bunch of Puerto Rican Christians to help Palestinian communists fight Israeli Jews. Ah, the fruits of globalization!\n\nMore short episodes like this will be available to subscribers only at the MartyrMade Substack (subscribe.martyrmade.com).",
      "tags": [],
      "view_count": 1638,
      "channel_id": "UCeDF9E2rwf_iQhcVGoFiqKQ",
      "url": "https://www.youtube.com/watch?v=Mzs7YlFgkOc"
    },
    {
      "video_id": "OlJfplzkkM4",
      "title": "#19 – The Anti-Humans",
      "thumbnail": "https://i.ytimg.com/vi/OlJfplzkkM4/hqdefault.jpg",
      "published_at": "2024-06-21T02:06:54Z",
      "duration": 13983.0,
      "description": "History is replete with examples of leaders, nations, and empires who left a trail of blood behind them. But with the Bolshevik takeover of Russia after the First World War, something new crawled from the depths of the earth onto the surface of the world. Never before had a government shown such uninhibited savagery toward its own people, during peacetime, as a matter of policy and in the name of scientific management. After Nazi Germany was defeated in the Second World War, Stalin’s Soviet Union unleashed hell on the devastated nations of Eastern Europe, leaving behind an unmatched record of sadism and brutality.\n\nSupport the show by subscribing to the MartyrMade Substack. (https://subscribe.martyrmade.com)",
      "tags": [],
      "view_count": 29802,
      "channel_id": "UCeDF9E2rwf_iQhcVGoFiqKQ",
      "url": "https://www.youtube.com/watch?v=OlJfplzkkM4"
    },
    {
      "video_id": "zUWP3_qevBM",
      "title": "#20 – The Underground Spirit",
      "thumbnail": "https://i.ytimg.com/vi/zUWP3_qevBM/hqdefault.jpg",
      "published_at": "2024-06-21T02:06:56Z",
      "duration": 17921.0,
      "description": "There’s a quote always attributed to Winston Churchill – falsely, I think? – that goes something like, “If you’re not a liberal at 20, you have no heart. If you’re not a conservative by 30, you have no brain.” I’ve got a different version that I like a lot better, and it goes, “If you’re not reading Nietzsche at 20, you have no heart. But if you haven’t transitioned to Dostoevsky by 30…” In this episode, I look through the lives and work of the two 19th century existentialist authors, who have a great deal in common, but who, in the end, couldn’t be more different.\n\nSupport the show by subscribing to the MartyrMade Substack (https://subscribe.martyrmade.com) .",
      "tags": [],
      "view_count": 10985,
      "channel_id": "UCeDF9E2rwf_iQhcVGoFiqKQ",
      "url": "https://www.youtube.com/watch?v=zUWP3_qevBM"
    },
    {
      "video_id": "pnaNxkgVBMY",
      "title": "Thoughts on Ukraine (Updated and Remastered)",
      "thumbnail": "https://i.ytimg.com/vi/pnaNxkgVBMY/hqdefault.jpg",
      "published_at": "2024-06-21T02:06:58Z",
      "duration": 8850.0,
      "description": "Hey everybody. Many of you have asked for my thoughts on the crisis in Ukraine, so here they are. I re-recorded it because the audio was trash the first time around. Sorry about that.\n\nThis is the kind of content I usually put on the Substack subscribers-only feed, so if you like this and can spare $5, please consider supporting the podcast by subscribing at martyrmade.substack.com (http://subscribe.martyrmade.com) .\n\nHere are some links I mention in the show:\n\nThe Snipers Massacre On Maidan (https://www.researchgate.net/publication/266855828_The_Snipers'_Massacre_on_the_Maidan_in_Ukraine) \n\nHow the West Sowed the Seeds of War in Ukraine, by Pedro Gonzalez (https://contra.substack.com/p/how-the-west-sowed-the-seeds-of-war?s=r) \n\nMy Twitter thread on the Rand Corporation’s strategy white paper (https://twitter.com/martyrmade/status/1499796614017273861) \n\nScott Horton’s recent speech on the Ukraine crisis (https://www.youtube.com/watch?v=NbiuAfcpzQU&t) \n\n\n\n\n\n\nThanks for listening.",
      "tags": [],
      "view_count": 5787,
      "channel_id": "UCeDF9E2rwf_iQhcVGoFiqKQ",
      "url": "https://www.youtube.com/watch?v=pnaNxkgVBMY"
    },
    {
      "video_id": "KGFvJyP3few",
      "title": "#21 Whose America?: Prologue",
      "thumbnail": "https://i.ytimg.com/vi/KGFvJyP3few/hqdefault.jpg",
      "published_at": "2024-06-21T02:07:01Z",
      "duration": 5951.0,
      "description": "Hi everyone. Here is the first episode – well, the prologue – for a brand new Martyr Made series called Whose America?, on the American labor wars. This is a series I’ve been working on for a while, and a story very close to my heart.\n\nThis episode has already been available to Substack subcribers for a week. I will be doing that from now on, so you can add that to the list of benefits available to subscribers for just $5 p/month or $50 p/year. If you enjoy this episode, or even if you don’t but just want to keep my cats from starving, please consider supporting the podcast by becoming a paid subscriber to the MartyrMade Substack (https://subscribe.martyrmade.com) .\n\nThanks for listening!",
      "tags": [],
      "view_count": 3512,
      "channel_id": "UCeDF9E2rwf_iQhcVGoFiqKQ",
      "url": "https://www.youtube.com/watch?v=KGFvJyP3few"
    },
    {
      "video_id": "407acHQpzR4",
      "title": "#22 Whose America?, ep. 1: Rough Extraction",
      "thumbnail": "https://i.ytimg.com/vi/407acHQpzR4/hqdefault.jpg",
      "published_at": "2024-06-21T02:07:03Z",
      "duration": 20075.0,
      "description": "In August 1921, 10,000-20,000 armed coal miners marched on Mingo County, West Virginia to lift the martial law imposed there, free their jailed brethren, and avenge the assassination of one of their local heroes. At least 20,000 more wives, young boys and other civilians followed the army providing medical, logistical and other services. Before it was over, they would storm a mountainside under fire from entrenched machine guns, and while being bombed from the air. It was the largest and most serious armed insurrection in US history since the Civil War. This episode is going to discuss the West Virginia Coal Mine Wars, and The Battle of Blair Mountain.\n\nThese episodes are out a week or two early on the Substack feed (https://subscribe.martyrmade.com) . If you enjoy this content or want more essays and podcasts not available here, please consider becoming a subscriber over at Substack, it’s how I manage to be able to do this at all.\n\nHere’s the link to Jocko’s company, Origin (https://originmaine.com/) , that I mention in the intro. Go there and check out the high-end clothing, boots, jiu jitsu gis, hunting gear and more, all hand-made in the United States.\n\nHere’s the link to Daniele Bolelli’s History on Fire podcast (http://historyonfirepodcast.com/)  (also available wherever you get your podcasts).",
      "tags": [],
      "view_count": 6401,
      "channel_id": "UCeDF9E2rwf_iQhcVGoFiqKQ",
      "url": "https://www.youtube.com/watch?v=407acHQpzR4"
    },
    {
      "video_id": "qViXO_g1Vtg",
      "title": "#24 Enemy, Prologue: Enemies of All Mankind",
      "thumbnail": "https://i.ytimg.com/vi/qViXO_g1Vtg/hqdefault.jpg",
      "published_at": "2025-01-19T16:38:45Z",
      "duration": 6034.0,
      "description": "Support the podcast by subscribing to the Martyr Made Substack (https://subscribe.martyrmade.com/) .\n\n\n\n\n\n\nThe Second World War was the greatest catastrophe in human history. Sixty million people dead. Entire nations destroyed. All sides engaged in the wholesale slaughter of enemy civilian populations. And the nuclear demon unleashed upon the world. It was the war in which the United States and our allies conquered the world, and eighty years after Germany's defeat, the story of the war remains our civilization's most important load-bearing myth. Myths are stories told by the winners to legitimize their victory, but in real history the losers have their own story to tell. This series will explore the deep history of the Second World War through the eyes of the Enemy.",
      "tags": [],
      "view_count": 35629,
      "channel_id": "UCeDF9E2rwf_iQhcVGoFiqKQ",
      "url": "https://www.youtube.com/watch?v=qViXO_g1Vtg"
    }
  ]
}